{"module": "keras.src.models.functional", "class_name": "Functional", "config": {"name": "functional_2", "trainable": true, "layers": [{"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_shape": [null, null], "dtype": "int64", "sparse": false, "name": "source"}, "registered_name": null, "name": "source", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_shape": [null, null], "dtype": "int64", "sparse": false, "name": "target"}, "registered_name": null, "name": "target", "inbound_nodes": []}, {"module": null, "class_name": "PositionalEmbedding", "config": {"name": "positional_embedding", "trainable": true, "dtype": {"module": "keras", "class_name": "FloatDTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "input_dim": 25000, "output_dim": 512, "sequence_length": 30}, "registered_name": "PositionalEmbedding", "build_config": {"input_shape": [null, null]}, "name": "positional_embedding", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, null], "dtype": "int64", "keras_history": ["source", 0, 0]}}], "kwargs": {}}]}, {"module": null, "class_name": "PositionalEmbedding", "config": {"name": "positional_embedding_1", "trainable": true, "dtype": {"module": "keras", "class_name": "FloatDTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "input_dim": 25000, "output_dim": 512, "sequence_length": 30}, "registered_name": "PositionalEmbedding", "build_config": {"input_shape": [null, null]}, "name": "positional_embedding_1", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, null], "dtype": "int64", "keras_history": ["target", 0, 0]}}], "kwargs": {}}]}, {"module": null, "class_name": "TransformerEncoder", "config": {"name": "transformer_encoder", "trainable": true, "dtype": {"module": "keras", "class_name": "FloatDTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "embed_dim": 512, "dense_dim": 2048, "num_heads": 8}, "registered_name": "TransformerEncoder", "build_config": {"input_shape": [null, null, 512]}, "name": "transformer_encoder", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, null, 512], "dtype": "float32", "keras_history": ["positional_embedding", 0, 0]}}], "kwargs": {}}]}, {"module": null, "class_name": "TransformerDecoder", "config": {"name": "transformer_decoder", "trainable": true, "dtype": {"module": "keras", "class_name": "FloatDTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "embed_dim": 512, "dense_dim": 2048, "num_heads": 8}, "registered_name": "TransformerDecoder", "build_config": {"input_shape": [null, null, 512]}, "name": "transformer_decoder", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, null, 512], "dtype": "float32", "keras_history": ["positional_embedding_1", 0, 0]}}, {"class_name": "__keras_tensor__", "config": {"shape": [null, null, 512], "dtype": "float32", "keras_history": ["transformer_encoder", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Dropout", "config": {"name": "dropout", "trainable": true, "dtype": {"module": "keras", "class_name": "FloatDTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "rate": 0.5, "seed": null, "noise_shape": null}, "registered_name": null, "build_config": {"input_shape": [null, null, 512]}, "name": "dropout", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, null, 512], "dtype": "float32", "keras_history": ["transformer_decoder", 0, 0]}}], "kwargs": {"training": false}}]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_16", "trainable": true, "dtype": {"module": "keras", "class_name": "FloatDTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "units": 25000, "activation": "softmax", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, null, 512]}, "name": "dense_16", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, null, 512], "dtype": "float32", "keras_history": ["dropout", 0, 0]}}], "kwargs": {}}]}], "input_layers": [["source", 0, 0], ["target", 0, 0]], "output_layers": [["dense_16", 0, 0]]}, "registered_name": "Functional", "build_config": {"input_shape": null}, "compile_config": {"loss": "sparse_categorical_crossentropy", "loss_weights": null, "metrics": ["accuracy"], "weighted_metrics": null, "run_eagerly": false, "steps_per_execution": 1, "jit_compile": true}}